logs/tuning_sweep/2026-04-01_023420/batched-tokens-4096_bench.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a7c413e2d40>, trust_remote_code=False, seed=0, num_prompts=1024, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=512, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=64, model='Qwen/Qwen3-8B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=15.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-0a72292d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-01 02:48:04 [datasets.py:631] Sampling input_len from [512, 512] and output_len from [256, 256]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 15.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 1024/1024 [01:10<00:00, 14.43it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1024      
Failed requests:                         0         
Maximum request concurrency:             64        
Request rate configured (RPS):           15.00     
Benchmark duration (s):                  70.96     
Total input tokens:                      524288    
Total generated tokens:                  262144    
Request throughput (req/s):              14.43     
Output token throughput (tok/s):         3694.50   
Peak output token throughput (tok/s):    5231.00   
Peak concurrent requests:                78.00     
Total token throughput (tok/s):          11083.51  
---------------Time to First Token----------------
Mean TTFT (ms):                          40.00     
Median TTFT (ms):                        38.36     
P50 TTFT (ms):                           38.36     
P90 TTFT (ms):                           50.10     
P99 TTFT (ms):                           67.85     
---------------Inter-token Latency----------------
Mean ITL (ms):                           11.27     
Median ITL (ms):                         10.76     
P50 ITL (ms):                            10.76     
P90 ITL (ms):                            12.12     
P99 ITL (ms):                            22.05     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2925.06   
Median E2EL (ms):                        2924.38   
P50 E2EL (ms):                           2924.38   
P90 E2EL (ms):                           3073.04   
P99 E2EL (ms):                           3153.12   
==================================================